---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MutipleStairsPathInOneRunFailure
source: html/8fcbb6d8-f41e-67b7-5b7a-d082930040a4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MutipleStairsPathInOneRunFailure Property

Each stairs run can only have one stairs path.

## Syntax (C#)
```csharp
public static FailureDefinitionId MutipleStairsPathInOneRunFailure { get; }
```